GopalSaraf/Practicals/PSDL/include/proc/pic16f19176.h
extern volatile __bit                   S25C3               __at(0xE969);	// @ (0x1D2D * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA27<S25C4>
extern volatile __bit                   S25C4               __at(0xE999);	// @ (0x1D33 * 8 + 1)
#define                                 S25C4_bit           _BIT_ACCESS(LCDDATA27,1)
// LCDDATA33<S25C5>
extern volatile __bit                   S25C5               __at(0xE9C9);	// @ (0x1D39 * 8 + 1)
#define                                 S25C5_bit           _BIT_ACCESS(LCDDATA33,1)
// LCDDATA39<S25C6>
extern volatile __bit                   S25C6               __at(0xE9F9);	// @ (0x1D3F * 8 + 1)
#define                                 S25C6_bit           _BIT_ACCESS(LCDDATA39,1)
// LCDDATA45<S25C7>
extern volatile __bit                   S25C7               __at(0xEA29);	// @ (0x1D45 * 8 + 1)
#define                                 S25C7_bit           _BIT_ACCESS(LCDDATA45,1)
// LCDDATA3<S26C0>
extern volatile __bit                   S26C0               __at(0xE8DA);	// @ (0x1D1B * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<S26C1>
extern volatile __bit                   S26C1               __at(0xE90A);	// @ (0x1D21 * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<S26C2>
extern volatile __bit                   S26C2               __at(0xE93A);	// @ (0x1D27 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<S26C3>
extern volatile __bit                   S26C3               __at(0xE96A);	// @ (0x1D2D * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA27<S26C4>
extern volatile __bit                   S26C4               __at(0xE99A);	// @ (0x1D33 * 8 + 2)
#define                                 S26C4_bit           _BIT_ACCESS(LCDDATA27,2)
// LCDDATA33<S26C5>
extern volatile __bit                   S26C5               __at(0xE9CA);	// @ (0x1D39 * 8 + 2)
#define                                 S26C5_bit           _BIT_ACCESS(LCDDATA33,2)
// LCDDATA39<S26C6>
extern volatile __bit                   S26C6               __at(0xE9FA);	// @ (0x1D3F * 8 + 2)
#define                                 S26C6_bit           _BIT_ACCESS(LCDDATA39,2)
// LCDDATA45<S26C7>
extern volatile __bit                   S26C7               __at(0xEA2A);	// @ (0x1D45 * 8 + 2)
#define                                 S26C7_bit           _BIT_ACCESS(LCDDATA45,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0xE8DB);	// @ (0x1D1B * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<S27C1>
extern volatile __bit                   S27C1               __at(0xE90B);	// @ (0x1D21 * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<S27C2>
extern volatile __bit                   S27C2               __at(0xE93B);	// @ (0x1D27 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<S27C3>
extern volatile __bit                   S27C3               __at(0xE96B);	// @ (0x1D2D * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA27<S27C4>
extern volatile __bit                   S27C4               __at(0xE99B);	// @ (0x1D33 * 8 + 3)
#define                                 S27C4_bit           _BIT_ACCESS(LCDDATA27,3)
// LCDDATA33<S27C5>
extern volatile __bit                   S27C5               __at(0xE9CB);	// @ (0x1D39 * 8 + 3)
#define                                 S27C5_bit           _BIT_ACCESS(LCDDATA33,3)
// LCDDATA39<S27C6>
extern volatile __bit                   S27C6               __at(0xE9FB);	// @ (0x1D3F * 8 + 3)
#define                                 S27C6_bit           _BIT_ACCESS(LCDDATA39,3)
// LCDDATA45<S27C7>
extern volatile __bit                   S27C7               __at(0xEA2B);	// @ (0x1D45 * 8 + 3)
#define                                 S27C7_bit           _BIT_ACCESS(LCDDATA45,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0xE8DC);	// @ (0x1D1B * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<S28C1>
extern volatile __bit                   S28C1               __at(0xE90C);	// @ (0x1D21 * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<S28C2>
extern volatile __bit                   S28C2               __at(0xE93C);	// @ (0x1D27 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<S28C3>
extern volatile __bit                   S28C3               __at(0xE96C);	// @ (0x1D2D * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA27<S28C4>
extern volatile __bit                   S28C4               __at(0xE99C);	// @ (0x1D33 * 8 + 4)
#define                                 S28C4_bit           _BIT_ACCESS(LCDDATA27,4)
// LCDDATA33<S28C5>
extern volatile __bit                   S28C5               __at(0xE9CC);	// @ (0x1D39 * 8 + 4)
#define                                 S28C5_bit           _BIT_ACCESS(LCDDATA33,4)
// LCDDATA39<S28C6>
extern volatile __bit                   S28C6               __at(0xE9FC);	// @ (0x1D3F * 8 + 4)
#define                                 S28C6_bit           _BIT_ACCESS(LCDDATA39,4)
// LCDDATA45<S28C7>
extern volatile __bit                   S28C7               __at(0xEA2C);	// @ (0x1D45 * 8 + 4)
#define                                 S28C7_bit           _BIT_ACCESS(LCDDATA45,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0xE8DD);	// @ (0x1D1B * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<S29C1>
extern volatile __bit                   S29C1               __at(0xE90D);	// @ (0x1D21 * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<S29C2>
extern volatile __bit                   S29C2               __at(0xE93D);	// @ (0x1D27 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<S29C3>
extern volatile __bit                   S29C3               __at(0xE96D);	// @ (0x1D2D * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA27<S29C4>
extern volatile __bit                   S29C4               __at(0xE99D);	// @ (0x1D33 * 8 + 5)
#define                                 S29C4_bit           _BIT_ACCESS(LCDDATA27,5)
// LCDDATA33<S29C5>
extern volatile __bit                   S29C5               __at(0xE9CD);	// @ (0x1D39 * 8 + 5)
#define                                 S29C5_bit           _BIT_ACCESS(LCDDATA33,5)
// LCDDATA39<S29C6>
extern volatile __bit                   S29C6               __at(0xE9FD);	// @ (0x1D3F * 8 + 5)
#define                                 S29C6_bit           _BIT_ACCESS(LCDDATA39,5)
// LCDDATA45<S29C7>
extern volatile __bit                   S29C7               __at(0xEA2D);	// @ (0x1D45 * 8 + 5)
#define                                 S29C7_bit           _BIT_ACCESS(LCDDATA45,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<S30C1>
extern volatile __bit                   S30C1               __at(0xE90E);	// @ (0x1D21 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<S30C2>
extern volatile __bit                   S30C2               __at(0xE93E);	// @ (0x1D27 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0xE96E);	// @ (0x1D2D * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA27<S30C4>
extern volatile __bit                   S30C4               __at(0xE99E);	// @ (0x1D33 * 8 + 6)
#define                                 S30C4_bit           _BIT_ACCESS(LCDDATA27,6)
// LCDDATA33<S30C5>
extern volatile __bit                   S30C5               __at(0xE9CE);	// @ (0x1D39 * 8 + 6)
#define                                 S30C5_bit           _BIT_ACCESS(LCDDATA33,6)
// LCDDATA39<S30C6>
extern volatile __bit                   S30C6               __at(0xE9FE);	// @ (0x1D3F * 8 + 6)
#define                                 S30C6_bit           _BIT_ACCESS(LCDDATA39,6)
// LCDDATA45<S30C7>
extern volatile __bit                   S30C7               __at(0xEA2E);	// @ (0x1D45 * 8 + 6)
#define                                 S30C7_bit           _BIT_ACCESS(LCDDATA45,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<S31C1>
extern volatile __bit                   S31C1               __at(0xE90F);	// @ (0x1D21 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<S31C2>
extern volatile __bit                   S31C2               __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0xE96F);	// @ (0x1D2D * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA27<S31C4>
extern volatile __bit                   S31C4               __at(0xE99F);	// @ (0x1D33 * 8 + 7)
#define                                 S31C4_bit           _BIT_ACCESS(LCDDATA27,7)
// LCDDATA33<S31C5>
extern volatile __bit                   S31C5               __at(0xE9CF);	// @ (0x1D39 * 8 + 7)
#define                                 S31C5_bit           _BIT_ACCESS(LCDDATA33,7)
// LCDDATA39<S31C6>
extern volatile __bit                   S31C6               __at(0xE9FF);	// @ (0x1D3F * 8 + 7)
#define                                 S31C6_bit           _BIT_ACCESS(LCDDATA39,7)
// LCDDATA45<S31C7>
extern volatile __bit                   S31C7               __at(0xEA2F);	// @ (0x1D45 * 8 + 7)
#define                                 S31C7_bit           _BIT_ACCESS(LCDDATA45,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<S32C1>
extern volatile __bit                   S32C1               __at(0xE910);	// @ (0x1D22 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<S32C2>
extern volatile __bit                   S32C2               __at(0xE940);	// @ (0x1D28 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA28<S32C4>
extern volatile __bit                   S32C4               __at(0xE9A0);	// @ (0x1D34 * 8 + 0)
#define                                 S32C4_bit           _BIT_ACCESS(LCDDATA28,0)
// LCDDATA34<S32C5>
extern volatile __bit                   S32C5               __at(0xE9D0);	// @ (0x1D3A * 8 + 0)
#define                                 S32C5_bit           _BIT_ACCESS(LCDDATA34,0)
// LCDDATA40<S32C6>
extern volatile __bit                   S32C6               __at(0xEA00);	// @ (0x1D40 * 8 + 0)
#define                                 S32C6_bit           _BIT_ACCESS(LCDDATA40,0)
// LCDDATA46<S32C7>
extern volatile __bit                   S32C7               __at(0xEA30);	// @ (0x1D46 * 8 + 0)
#define                                 S32C7_bit           _BIT_ACCESS(LCDDATA46,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<S33C1>
extern volatile __bit                   S33C1               __at(0xE911);	// @ (0x1D22 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<S33C2>
extern volatile __bit                   S33C2               __at(0xE941);	// @ (0x1D28 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA28<S33C4>
extern volatile __bit                   S33C4               __at(0xE9A1);	// @ (0x1D34 * 8 + 1)
#define                                 S33C4_bit           _BIT_ACCESS(LCDDATA28,1)
// LCDDATA34<S33C5>
extern volatile __bit                   S33C5               __at(0xE9D1);	// @ (0x1D3A * 8 + 1)
#define                                 S33C5_bit           _BIT_ACCESS(LCDDATA34,1)
// LCDDATA40<S33C6>
extern volatile __bit                   S33C6               __at(0xEA01);	// @ (0x1D40 * 8 + 1)
#define                                 S33C6_bit           _BIT_ACCESS(LCDDATA40,1)
// LCDDATA46<S33C7>
extern volatile __bit                   S33C7               __at(0xEA31);	// @ (0x1D46 * 8 + 1)
#define                                 S33C7_bit           _BIT_ACCESS(LCDDATA46,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<S34C1>
extern volatile __bit                   S34C1               __at(0xE912);	// @ (0x1D22 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<S34C2>
extern volatile __bit                   S34C2               __at(0xE942);	// @ (0x1D28 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA28<S34C4>
extern volatile __bit                   S34C4               __at(0xE9A2);	// @ (0x1D34 * 8 + 2)
#define                                 S34C4_bit           _BIT_ACCESS(LCDDATA28,2)
// LCDDATA34<S34C5>
extern volatile __bit                   S34C5               __at(0xE9D2);	// @ (0x1D3A * 8 + 2)
#define                                 S34C5_bit           _BIT_ACCESS(LCDDATA34,2)
// LCDDATA40<S34C6>
extern volatile __bit                   S34C6               __at(0xEA02);	// @ (0x1D40 * 8 + 2)
#define                                 S34C6_bit           _BIT_ACCESS(LCDDATA40,2)
// LCDDATA46<S34C7>
extern volatile __bit                   S34C7               __at(0xEA32);	// @ (0x1D46 * 8 + 2)
#define                                 S34C7_bit           _BIT_ACCESS(LCDDATA46,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0xC95);	// @ (0x192 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0xE870);	// @ (0x1D0E * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0xE871);	// @ (0x1D0E * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0xE872);	// @ (0x1D0E * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0xE873);	// @ (0x1D0E * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0xE874);	// @ (0x1D0E * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0xE875);	// @ (0x1D0E * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0xE876);	// @ (0x1D0E * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0xE877);	// @ (0x1D0E * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0xE878);	// @ (0x1D0F * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
extern volatile __bit                   SE09                __at(0xE879);	// @ (0x1D0F * 8 + 1)
#define                                 SE09_bit            _BIT_ACCESS(LCDSE1,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0xE87A);	// @ (0x1D0F * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0xE87B);	// @ (0x1D0F * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0xE87C);	// @ (0x1D0F * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0xE87D);	// @ (0x1D0F * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0xE87E);	// @ (0x1D0F * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0xE87F);	// @ (0x1D0F * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0xE880);	// @ (0x1D10 * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0xE881);	// @ (0x1D10 * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0xE882);	// @ (0x1D10 * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0xE883);	// @ (0x1D10 * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0xE884);	// @ (0x1D10 * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0xE885);	// @ (0x1D10 * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0xE886);	// @ (0x1D10 * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0xE887);	// @ (0x1D10 * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0xE888);	// @ (0x1D11 * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0xE889);	// @ (0x1D11 * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0xE88A);	// @ (0x1D11 * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0xE88B);	// @ (0x1D11 * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0xE88C);	// @ (0x1D11 * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0xE88D);	// @ (0x1D11 * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0xE88E);	// @ (0x1D11 * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0xE88F);	// @ (0x1D11 * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0xE890);	// @ (0x1D12 * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0xE891);	// @ (0x1D12 * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0xE892);	// @ (0x1D12 * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0xE893);	// @ (0x1D12 * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0xE894);	// @ (0x1D12 * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0xE895);	// @ (0x1D12 * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0xE896);	// @ (0x1D12 * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0xE897);	// @ (0x1D12 * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE5<SE40>
